<?xml version="1.0" encoding="UTF-8"?><feed xmlns="http://www.w3.org/2005/Atom">
  <title>GitHub All Languages Daily Trending</title>
  <id>http://mshibanami.github.io/GitHubTrendingRSS</id>
  <updated>2023-07-09T01:31:07Z</updated>
  <subtitle>Daily Trending of All Languages in GitHub</subtitle>
  <link href="http://mshibanami.github.io/GitHubTrendingRSS"></link>
  <entry>
    <title>ixahmedxi/noodle</title>
    <updated>2023-07-09T01:31:07Z</updated>
    <id>tag:github.com,2023-07-09:/ixahmedxi/noodle</id>
    <link href="https://github.com/ixahmedxi/noodle" rel="alternate"></link>

    <summary type="html">&lt;p&gt;CVE-2023-3269: Linux kernel privilege escalation vulnerability&lt;/p&gt;&lt;hr&gt;&lt;h1&gt;StackRot (CVE-2023-3269): Linux kernel privilege escalation vulnerability&lt;/h1&gt; &#xA;&lt;p&gt;&lt;strong&gt;This serves as an &#34;early&#34; disclosure of the StackRot vulnerability, in compliance with &lt;a href=&#34;https://oss-security.openwall.org/wiki/mailing-lists/distros&#34;&gt;the policy of the linux-distros list&lt;/a&gt;. While all the essential vulnerability details have been provided here, the complete exploit code and a comprehensive write-up will be made publicly available no later than the end of July. &lt;a href=&#34;https://www.openwall.com/lists/oss-security/2023/07/05/1&#34;&gt;The oss-security thread&lt;/a&gt; will be notified, and any updates will be reflected in this GitHub repository.&lt;/strong&gt;&lt;/p&gt; &#xA;&lt;p&gt;A flaw was found in the handling of stack expansion in the Linux kernel 6.1 through 6.4, aka &#34;Stack Rot&#34;. The maple tree, responsible for managing virtual memory areas, can undergo node replacement without properly acquiring the MM write lock, leading to use-after-free issues. An unprivileged local user could use this flaw to compromise the kernel and escalate their privileges.&lt;/p&gt; &#xA;&lt;p&gt;As StackRot is a Linux kernel vulnerability found in the memory management subsystem, it affects almost all kernel configurations and requires minimal capabilities to trigger. However, it should be noted that maple nodes are freed using RCU callbacks, delaying the actual memory deallocation until after the RCU grace period. Consequently, exploiting this vulnerability is considered challenging.&lt;/p&gt; &#xA;&lt;p&gt;To the best of my knowledge, there are currently no publicly available exploits targeting use-after-free-by-RCU (UAFBR) bugs. This marks the first instance where UAFBR bugs have been proven to be exploitable, even without the presence of CONFIG_PREEMPT or CONFIG_SLAB_MERGE_DEFAULT settings. Notably, this exploit has been successfully demonstrated in the environment provided by &lt;a href=&#34;https://google.github.io/kctf/vrp.html&#34;&gt;Google kCTF VRP&lt;/a&gt; (&lt;a href=&#34;https://storage.googleapis.com/kctf-vrp-public-files/bzImage_upstream_6.1.25&#34;&gt;bzImage_upstream_6.1.25&lt;/a&gt;, &lt;a href=&#34;https://storage.googleapis.com/kctf-vrp-public-files/bzImage_upstream_6.1.25_config&#34;&gt;config&lt;/a&gt;).&lt;/p&gt; &#xA;&lt;p&gt;The StackRot vulnerability has been present in the Linux kernel since version 6.1 when the VMA tree structure was &lt;a href=&#34;https://lore.kernel.org/lkml/20220906194824.2110408-1-Liam.Howlett@oracle.com/&#34;&gt;changed&lt;/a&gt; from red-black trees to maple trees.&lt;/p&gt; &#xA;&lt;h2&gt;Background&lt;/h2&gt; &#xA;&lt;p&gt;Whenever the &lt;code&gt;mmap()&lt;/code&gt; system call is utilized to establish a memory mapping, the kernel generates a structure called &lt;code&gt;vm_area_struct&lt;/code&gt; to represent the corresponding virtual memory area (VMA). This structure stores various information including flags, properties, and other pertinent details related to the mapping.&lt;/p&gt; &#xA;&lt;pre&gt;&lt;code class=&#34;language-c&#34;&gt;struct vm_area_struct {&#xA;        long unsigned int          vm_start;             /*     0     8 */&#xA;        long unsigned int          vm_end;               /*     8     8 */&#xA;        struct mm_struct *         vm_mm;                /*    16     8 */&#xA;        pgprot_t                   vm_page_prot;         /*    24     8 */&#xA;        long unsigned int          vm_flags;             /*    32     8 */&#xA;        union {&#xA;                struct {&#xA;                        struct rb_node rb __attribute__((__aligned__(8))); /*    40    24 */&#xA;                        /* --- cacheline 1 boundary (64 bytes) --- */&#xA;                        long unsigned int rb_subtree_last; /*    64     8 */&#xA;                } __attribute__((__aligned__(8))) shared __attribute__((__aligned__(8))); /*    40    32 */&#xA;                struct anon_vma_name * anon_name;        /*    40     8 */&#xA;        } __attribute__((__aligned__(8)));               /*    40    32 */&#xA;        /* --- cacheline 1 boundary (64 bytes) was 8 bytes ago --- */&#xA;        struct list_head           anon_vma_chain;       /*    72    16 */&#xA;        struct anon_vma *          anon_vma;             /*    88     8 */&#xA;        const struct vm_operations_struct  * vm_ops;     /*    96     8 */&#xA;        long unsigned int          vm_pgoff;             /*   104     8 */&#xA;        struct file *              vm_file;              /*   112     8 */&#xA;        void *                     vm_private_data;      /*   120     8 */&#xA;        /* --- cacheline 2 boundary (128 bytes) --- */&#xA;        atomic_long_t              swap_readahead_info;  /*   128     8 */&#xA;        struct vm_userfaultfd_ctx  vm_userfaultfd_ctx;   /*   136     0 */&#xA;&#xA;        /* size: 136, cachelines: 3, members: 14 */&#xA;        /* forced alignments: 1 */&#xA;        /* last cacheline: 8 bytes */&#xA;} __attribute__((__aligned__(8)));&#xA;&lt;/code&gt;&lt;/pre&gt; &#xA;&lt;p&gt;Subsequently, when the kernel encounters page faults or other memory-related system calls, it requires fast lookup of the VMA solely based on the address. Previously, the VMAs were managed using red-black trees. However, starting from Linux kernel version 6.1, the migration to maple trees took place. &lt;a href=&#34;https://docs.kernel.org/6.4/core-api/maple_tree.html&#34;&gt;Maple trees&lt;/a&gt; are RCU-safe B-tree data structures optimized for storing non-overlapping ranges. Nonetheless, their intricate nature adds complexity to the codebase and introduces the StackRot vulnerability.&lt;/p&gt; &#xA;&lt;p&gt;In essence, the maple tree is composed of maple nodes. Throughout this article, it is assumed that the maple tree has only a single root node, which can contain a maximum of 16 intervals. Each interval can either represent a gap or point to a VMA. Thus, no gaps are allowed between two intervals.&lt;/p&gt; &#xA;&lt;pre&gt;&lt;code class=&#34;language-c&#34;&gt;struct maple_range_64 {&#xA;        struct maple_pnode *       parent;               /*     0     8 */&#xA;        long unsigned int          pivot[15];            /*     8   120 */&#xA;        /* --- cacheline 2 boundary (128 bytes) --- */&#xA;        union {&#xA;                void *             slot[16];             /*   128   128 */&#xA;                struct {&#xA;                        void *     pad[15];              /*   128   120 */&#xA;                        /* --- cacheline 3 boundary (192 bytes) was 56 bytes ago --- */&#xA;                        struct maple_metadata meta;      /*   248     2 */&#xA;                };                                       /*   128   128 */&#xA;        };                                               /*   128   128 */&#xA;&#xA;        /* size: 256, cachelines: 4, members: 3 */&#xA;};&#xA;&lt;/code&gt;&lt;/pre&gt; &#xA;&lt;p&gt;The structure &lt;code&gt;maple_range_64&lt;/code&gt; represents a maple node in the following manner. The pivots indicate the endpoints of 16 intervals, while the slots are used to reference the VMA structure when the node is considered a leaf node. The layout of pivots and slots can be visualized as shown below:&lt;/p&gt; &#xA;&lt;pre&gt;&lt;code&gt; Slots -&amp;gt; | 0 | 1 | 2 | ... | 12 | 13 | 14 | 15 |&#xA;          ┬   ┬   ┬   ┬     ┬    ┬    ┬    ┬    ┬&#xA;          │   │   │   │     │    │    │    │    └─ Implied maximum&#xA;          │   │   │   │     │    │    │    └─ Pivot 14&#xA;          │   │   │   │     │    │    └─ Pivot 13&#xA;          │   │   │   │     │    └─ Pivot 12&#xA;          │   │   │   │    